<?php
/**
 * Created by PhpStorm.
 * User:ykuang
 * Date: 2016/12/15
 * Time: 11:47
 */

namespace Multiple\Api\Controllers;


use Services\Site\AreaManager;

class AreaController extends ControllerBase
{
    /*获取省列表*/
    public function getProvincesAction()
    {
        $province = AreaManager::getInstance()->getProvinces();
        $this->ajax->outRight(array_values($province));
    }

    /*获取市区列表*/
    public function getCitiesAction()
    {
        $province_id = $this->request->get('province_id', 'int', 0); //省份
        $cities = AreaManager::getInstance()->getCities($province_id);
        $this->ajax->outRight(array_values($cities));
    }

   //获取城市区域代码
    public function getCityCodeAction()
    {
        $data = "北京市:010,天津市:022,上海市:021,重庆市:023,香港:852,澳门:853,台湾:886,石家庄市:0311,邯郸市:0310,邢台市:0319,保定市:0312,张家口市:0313,承德市:0314,唐山市:0315,秦皇岛市:0335,沧州市:0317,廊坊市:0316,衡水市:0318,福州市:0591,厦门市:0592,三明市:0598,莆田市:0594,泉州市:0595,漳州市:0596,南平市:0599,宁德市:0593,龙岩市:0597,南昌市:0791,萍乡市:0799,景德镇市:0798,新余市:0790,九江市:0792,鹰潭市:0701,上饶市:0793,宜春市:0795,临川市:0794,吉安市:0796,赣州市:0797,济南市:0531,菏泽市:0530,淮坊市:0536,济宁市:0537,泰安市:0538,临沂市:0539,青岛市:0532,淄博市:0533,烟台市:0535,威海市:0631,日照市:0633,德州市:0534,太原市:0351,大同市:0352,阳泉市:0353,长治市:0355,朔州市:0349,榆次市:0354,吕梁市:0358,临汾市:0357,运城市:0359,忻州市:0350,晋城市:0356,呼和浩特:0471,乌海市:0473,集宁市:0474,赤峰市:0476,阿拉善左旗:0483,包头市:0472,二连浩特市:0479,满洲里市:0470,通辽市:0475,准格尔旗:0477,乌兰浩特市:0482,郑州市:0371,开封市:0378,洛阳市:0379,新乡市:0373,濮阳市:0393,商丘市:0370,安阳市:0372,平顶山:0375,信阳市:0376,焦作市:0391,鹤壁市:0392,漯河市:0395,驻马店:0396,三门峡:0398,南阳市:0377,周口市:0394,沈阳市:024,大连市:0411,鞍山市:0412,朝阳市:0421,盘锦市:0427,葫芦岛:0429,抚顺市:0413,本溪市:0414,丹东市:0415,锦州市:0416,营口市:0417,阜新市:0418,辽阳市:0419,铁岭市:0410,武汉市:027,襄城市:0710,咸宁市:0715,荆沙市:0716,随枣市:0722,江汉市:0728,黄石市:0714,十堰市:0719,宜昌市:0717,孝感市:0712,黄冈市:0713,恩施市:0718,长春市:0431,吉林市:0423,四平市:0434,辽源市:0437,通化市:0435,临江市:0439,大安市:0436,珲春市:0440,延吉市:0433,松原市:0438,长沙市:0731,株州市:0733,湘潭市:0732,衡阳市:0734,岳阳市:0730,常德市:0736,郴州市:0735,娄底市:0738,邵阳市:0739,吉首市:0743,益阳市:0737,冷水滩:0746,怀化市:0745,张家界:0744,哈尔滨市:0451,阿城市:0450,绥化市:0455,黑河市:0456,齐齐哈尔市:0452,大庆市:0459,伊春市:0458,牡丹江市:0453,佳木斯市:0454,漠河县:0457,广州市:020,深圳市:0755,梅州市:0753,肇庆市:0758,河源市:0762,清远市:0763,顺德市:0765,云浮市:0766,潮州市:0768,汕尾市:0660,潮阳市:0661,阳江市:0662,揭西市:0663,珠海市:0756,汕头市:0754,韶关市:0751,惠州市:0752,东莞市:0769,中山市:0760,佛山市:0757,湛江市:0759,南京市:025,泰州市:0523,徐州市:0516,连云港市:0518,淮安市:0517,宿迁市:0527,盐城市:0515,扬州市:0514,南通市:0513,镇江市:0511,常州市:0519,无锡市:0510,苏州市:0512,常熟市:0520,南宁市:0771,柳州市:0772,桂林市:0773,梧州市:0774,北海市:0779,防城港:0770,玉林市:0775,百色市:0776,河池市:0778,钦州市:0777,海口市:0898,三亚市:0899,儋州市:0890,成都市:028,涪陵市:0810,永川市:0814,南充市:0817,达县市:0818,万县市:0819,遂宁市:0825,广安市:0826,巴中市:0827,西昌市:0834,雅安市:0835,康定市:0836,马尔康:0837,广元市:0839,攀枝花市:0812,德阳市:0838,绵阳市:0816,自贡市:0813,内江市:0832,乐山市:0833,泸州市:0830,宜宾市:0831,杭州市:0571,宁波市:0574,嘉兴市:0573,湖州市:0572,绍兴市:0575,金华市:0579,丽水市:0578,衢州市:0570,舟山市:0580,温州市:0577,台州市:0576,贵阳市:0851,遵义市:0852,安顺市:0853,都均市:0854,凯里市:0855,铜仁市:0856,毕节市:0857,兴义市:0859,六盘水市:0858,合肥市:0551,淮南市:0554,蚌埠市:0552,马鞍山市:0555,安庆市:0556,黄山市:0559,滁州市:0550,芜湖市:0553,阜阳市:0558,淮北市:0561,铜陵市:0562,宣城市:0563,六安市:0564,贵池市:0566,宿州市:0557,巢湖市:0565,昆明市:0871,保山市:0875,文山市:0876,玉溪市:0877,景洪市:0691,潞西市:0692,东川市:0881,临沧市:0883,六库市:0886,中甸市:0887,丽江市:0888,大理市:0872,昭通市:0870,曲靖市:0874,思茅市:0879,开远市:0873,楚雄市:0878,西安市:029,铜川市:0919,咸阳市:0910,延安市:0911,榆林市:0912,商洛市:0914,安康市:0915,汉中市:0916,宝鸡市:0917,渭南市:0913,拉萨市:0891,日喀则市:0892,山南市:0893,仁布县:08018,丁青县:08059,阿里地区:0897,兰州市:0931,金昌市:0935,天水市:0938,临夏市:0930,定西市:0932,西峰市:0934,张掖市:0936,酒泉市:0937,甘南州:0941,白银市:0943,平凉市:0933,西宁市:0971,海东市:0972,同仁市:0973,共和市:0974,玛沁市:0975,玉树市:0976,德令哈:0977,格尔木市:0979,银川市:0951,吴忠市:0953,固原市:0954,石嘴山市:0952,乌鲁木齐市:0991,克拉玛依市:0990,吐鲁番市:0995,喀什市:0998,阿图什市:0908,库尔勒市:0996";
        $hot_city = ["010", "020", "021", "0755", "0571"];
        $data = explode(",", $data);
        $res = [];
        foreach ($data as $item) {
            $c = explode(':', $item);
            $tmp = ["c" => $c[1], 'n' => $c[0], 'h' => in_array($c[1], $hot_city) ? 1 : 0];
            $res[] = $tmp;
        }
        $this->ajax->outRight($res);
    }

}